<template>
  <section id="promotion">
    <div class="selection-title">
      <div class="text">PROMOTION</div>
      <div class="line"></div>
    </div>

    <div class="detail-text">
      <p>
        私の強みはプログラミングへの興味と、そこから生まれる効率化へのこだわりです。
      </p>
      <p>
        自分で書いたコードでも、読み返しに時間がかかる経験から、
        「いかにわかりやすく、効率的なコードを書くか」
        を意識するようになりました。
      </p>

      <ul>
          <li>名前付け: コードの意図が一目でわかるようにする。</li>
          <li>部品化: 各処理を分けることで問題点の早期発見・検証を容易にします。</li>
          <li>共通化: コードの重複を減らし、保守性と可読性を高める。</li>
      </ul>

      <p>
        これらの取り組みにより、自分のコードが理解しやすくなるだけでなく、
        チームメンバーのコードレビューにおいても、よりシンプルでわかりやすい改善提案ができるようになりました。

        さらに業務の効率化にも積極的に取り組んでいます。
        Bashスクリプトによる作業の自動化や、VS Codeの拡張機能を自作して、
        日々の業務をスムーズに進めるための工夫を凝らして来ました。
      </p>
      <p>
        この「効率化」の経験とプログラミングへの情熱を活かし、
        業務への理解を深め、自動化や時間短縮が可能な部分を見つけ出し、改善に貢献したいと考えています。
        効率化によって生まれた時間を活用し、新たな技術習得やメンバーサポート、サービスのさらなる向上に
        尽力することで、チーム全体の生産性向上に貢献してまいります。
      </p>
    </div>
  </section>
</template>